Tested locally, here's the example and output. Method was a mild modification of the existing makefile tasks for local build and apply that removed the env vars related to RP cloud. Also involved a manual copy of the AWS provider into the plugin directories. 

Config

```provider "aws" {
  region = "us-east-2"
  access_key = "ACCESS_KEY"
  secret_key = "SECRET_KEY"
}

provider "redpanda" {
  client_id = local.secret_values["client_id"]
    client_secret = local.secret_values["client_secret"]
}

# Data source to fetch the secret
data "aws_secretsmanager_secret" "test" {
  name = "test"
}

# Data source to fetch the secret version
data "aws_secretsmanager_secret_version" "secret_version" {
  secret_id = data.aws_secretsmanager_secret.test.id
}

locals {
  secret_values = jsondecode(data.aws_secretsmanager_secret_version.secret_version.secret_string)
}


resource "redpanda_resource_group" "test" {
  name = var.resource_group_name
}

resource "redpanda_network" "test" {
  name              = var.network_name
  resource_group_id = redpanda_resource_group.test.id
  cloud_provider    = var.cloud_provider
  region            = var.region
  cluster_type      = "dedicated"
  cidr_block        = "10.0.0.0/20"
}

resource "redpanda_cluster" "test" {
  name              = var.cluster_name
  resource_group_id = redpanda_resource_group.test.id
  network_id        = redpanda_network.test.id
  cloud_provider    = var.cloud_provider
  region            = var.region
  cluster_type      = "dedicated"
  connection_type   = "public"
  throughput_tier   = var.throughput_tier
  zones             = var.zones
  allow_deletion    = true
  tags = {
    "key" = "value"
  }
}```

```Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Finding latest version of hashicorp/redpanda...
- Installing hashicorp/aws v5.84.0...
- Installed hashicorp/aws v5.84.0 (unauthenticated)
- Installing hashicorp/redpanda v0.7.1...
- Installed hashicorp/redpanda v0.7.1 (unauthenticated)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Incomplete lock file information for providers
│ 
│ Due to your customized provider installation methods, Terraform was forced to calculate lock file checksums locally for the following providers:
│   - hashicorp/aws
│   - hashicorp/redpanda
│ 
│ The current .terraform.lock.hcl file only includes checksums for darwin_arm64, so Terraform running on another platform will fail to install these providers.
│ 
│ To calculate additional checksums for another platform, run:
│   terraform providers lock -platform=linux_amd64
│ (where linux_amd64 is the platform to generate)
╵

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Constructing Terraform apply command...
data.aws_secretsmanager_secret.test: Reading...
data.aws_secretsmanager_secret.test: Read complete after 0s [id=arn:aws:secretsmanager:us-east-2:ACC:secret:test-Dek9iL]
data.aws_secretsmanager_secret_version.secret_version: Reading...
data.aws_secretsmanager_secret_version.secret_version: Read complete after 0s [id=arn:aws:secretsmanager:us-east-2:ACC:secret:test-Dek9iL|AWSCURRENT]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # redpanda_acl.test will be created
  + resource "redpanda_acl" "test" {
      + cluster_api_url       = (known after apply)
      + host                  = "*"
      + id                    = (known after apply)
      + operation             = "READ"
      + permission_type       = "ALLOW"
      + principal             = "User:test-username"
      + resource_name         = "test-topic"
      + resource_pattern_type = "LITERAL"
      + resource_type         = "TOPIC"
    }

  # redpanda_cluster.test will be created
  + resource "redpanda_cluster" "test" {
      + allow_deletion    = true
      + cloud_provider    = "aws"
      + cluster_api_url   = (known after apply)
      + cluster_type      = "dedicated"
      + connection_type   = "public"
      + id                = (known after apply)
      + name              = "tfrp-local-YOiR"
      + network_id        = (known after apply)
      + region            = "us-east-2"
      + resource_group_id = (known after apply)
      + tags              = {
          + "key" = "value"
        }
      + throughput_tier   = "tier-1-aws-v2-arm"
      + zones             = [
          + "use2-az1",
          + "use2-az2",
          + "use2-az3",
        ]
    }

  # redpanda_network.test will be created
  + resource "redpanda_network" "test" {
      + cidr_block        = "10.0.0.0/20"
      + cloud_provider    = "aws"
      + cluster_type      = "dedicated"
      + id                = (known after apply)
      + name              = "tfrp-local-YOiR"
      + region            = "us-east-2"
      + resource_group_id = (known after apply)
    }

  # redpanda_resource_group.test will be created
  + resource "redpanda_resource_group" "test" {
      + id   = (known after apply)
      + name = "tfrp-local-YOiR"
    }

  # redpanda_topic.test will be created
  + resource "redpanda_topic" "test" {
      + allow_deletion     = true
      + cluster_api_url    = (known after apply)
      + configuration      = (known after apply)
      + id                 = (known after apply)
      + name               = "test-topic"
      + partition_count    = 3
      + replication_factor = 3
    }

  # redpanda_user.test will be created
  + resource "redpanda_user" "test" {
      + cluster_api_url = (known after apply)
      + id              = (known after apply)
      + mechanism       = "scram-sha-256"
      + name            = "test-username"
      + password        = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
redpanda_resource_group.test: Creating...
redpanda_resource_group.test: Creation complete after 1s [id=543dd5b4-5992-44ac-992a-77078f661576]
redpanda_network.test: Creating...
redpanda_network.test: Still creating... [10```